podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_4CH_TRIG_MKW41Z4.svd.xml
<!--
Devices using this peripheral: 
      MKW41Z4
-->
      <peripheral>
         <?sourceFile "DMAMUX0_4CH_TRIG_MKW41Z4" ?>
         <name>DMAMUX0</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>4</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>CHCFG%s</name>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disabled</name>
                           <description>Disable</description>
                           <value>0b000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved1</name>
                           <description>Reserved</description>
                           <value>0b000001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART0_Rx</name>
                           <description>LPUART0 Receive</description>
                           <value>0b000010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART0_Tx</name>
                           <description>LPUART0 Transmit</description>
                           <value>0b000011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved4</name>
                           <description>Reserved</description>
                           <value>0b000100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved5</name>
                           <description>Reserved</description>
                           <value>0b000101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved6</name>
                           <description>Reserved</description>
                           <value>0b000110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved7</name>
                           <description>Reserved</description>
                           <value>0b000111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved8</name>
                           <description>Reserved</description>
                           <value>0b001000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved9</name>
                           <description>Reserved</description>
                           <value>0b001001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved10</name>
                           <description>Reserved</description>
                           <value>0b001010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved11</name>
                           <description>Reserved</description>
                           <value>0b001011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved12</name>
                           <description>Reserved</description>
                           <value>0b001100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved13</name>
                           <description>Reserved</description>
                           <value>0b001101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved14</name>
                           <description>Reserved</description>
                           <value>0b001110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved15</name>
                           <description>Reserved</description>
                           <value>0b001111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Rx</name>
                           <description>SPI0 Receive</description>
                           <value>0b010000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Tx</name>
                           <description>SPI0 Transmit</description>
                           <value>0b010001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_Rx</name>
                           <description>SPI1 Receive</description>
                           <value>0b010010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_Tx</name>
                           <description>SPI1 Transmit</description>
                           <value>0b010011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_Input_FIFO</name>
                           <description>LTC0_Input_FIFO</description>
                           <value>0b010100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_Output_FIFO</name>
                           <description>LTC0_Output_FIFO</description>
                           <value>0b010101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C0</name>
                           <description>I2C0</description>
                           <value>0b010110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C1</name>
                           <description>I2C1</description>
                           <value>0b010111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch0</name>
                           <description>TPM0 Channel 0</description>
                           <value>0b011000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch1</name>
                           <description>TPM0 Channel 1</description>
                           <value>0b011001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch2</name>
                           <description>TPM0 Channel 2</description>
                           <value>0b011010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM0_Ch3</name>
                           <description>TPM0 Channel 3</description>
                           <value>0b011011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved28</name>
                           <description>Reserved</description>
                           <value>0b011100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved29</name>
                           <description>Reserved</description>
                           <value>0b011101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved30</name>
                           <description>Reserved</description>
                           <value>0b011110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved31</name>
                           <description>Reserved</description>
                           <value>0b011111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Ch0</name>
                           <description>TPM1 Channel 0</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Ch1</name>
                           <description>TPM1 Channel 1</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Ch0</name>
                           <description>TPM2 Channel 0</description>
                           <value>0b100010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Ch1</name>
                           <description>TPM2 Channel 1</description>
                           <value>0b100011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved36</name>
                           <description>Reserved</description>
                           <value>0b100100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved37</name>
                           <description>Reserved</description>
                           <value>0b100101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved38</name>
                           <description>Reserved</description>
                           <value>0b100110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved39</name>
                           <description>Reserved</description>
                           <value>0b100111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC0</name>
                           <description>ADC0</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved41</name>
                           <description>Reserved</description>
                           <value>0b101001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP0</name>
                           <description>CMP0</description>
                           <value>0b101010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved43</name>
                           <description>Reserved</description>
                           <value>0b101011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved44</name>
                           <description>Reserved</description>
                           <value>0b101100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC0</name>
                           <description>DAC0</description>
                           <value>0b101101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved46</name>
                           <description>Reserved</description>
                           <value>0b101110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMT</name>
                           <description>CMT</description>
                           <value>0b101111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved48</name>
                           <description>Reserved</description>
                           <value>0b110000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>49</name>
                           <description>PortA</description>
                           <value>0b110001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>50</name>
                           <description>PortB</description>
                           <value>0b110010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>51</name>
                           <description>PortC</description>
                           <value>0b110011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>52</name>
                           <description>Reserved</description>
                           <value>0b110100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>53</name>
                           <description>Reserved</description>
                           <value>0b110101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>54</name>
                           <description>TPM0_Overflow</description>
                           <value>0b110110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>55</name>
                           <description>TPM1_Overflow</description>
                           <value>0b110111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>56</name>
                           <description>TPM2_Overflow</description>
                           <value>0b111000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>57</name>
                           <description>TSI0</description>
                           <value>0b111001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>58</name>
                           <description>Reserved</description>
                           <value>0b111010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>59</name>
                           <description>Reserved</description>
                           <value>0b111011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled60</name>
                           <description>AlwaysEnabled60</description>
                           <value>0b111100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled61</name>
                           <description>AlwaysEnabled61</description>
                           <value>0b111101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled62</name>
                           <description>AlwaysEnabled62</description>
                           <value>0b111110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled63</name>
                           <description>AlwaysEnabled63</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directly routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
